# Http协议

Http一种基于TCP协议的网络应用层的协议，也是最常用的一种网络协议。客户端向服发送请求时，
先需要与服务器建立TCP连接，三次握手，握手成功后再进行数据的传输。

## Http Socket Tcp的区别

- TCP：网络传输层协议，是一种面对连接的可靠的传输协议。

  >UDP是一种非面对连接的不可靠的传输协议。

- Socket：是网络传输层和应用层的一个抽象。

  Socket可以基于TCP，也可以基于UDP。同理，基于TCP的为可靠的，基于UDP的为不可靠的。

  Socket分为长连接，短连接。**长连接是定时发送心跳包来维持连接状态。**

- Http

  Http连接中，只能由客户端向服务器发送请求，服务器返回响应。

  >Socket连接中，客户端和服务器都可以随时向对方发送消息。

  ### http Socket应用

  **http**：app、网页等通过get、post请求去获取图片、Json，上传下载文件等。

  **socket**：IM（即时聊天）应用基本是基于socket，不需要总是连接，保证信息高速传输。
